// Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго
Console.Write("Введите первое число");
int numberA = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число");
int numderB = Convert.ToInt32(Console.ReadLine());
if(numberA * numderA == numderB) Console.Write("да");
else Console.Write("нет");